tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
brew "act"
brew "automake"
brew "direnv"
brew "git"
brew "git-lfs"
brew "guile"
brew "gnutls"
brew "ideviceinstaller"
brew "libimobiledevice"
brew "libtool"
brew "mas"
brew "ruby-build"
brew "rbenv"
brew "ruby"
brew "ruby@2.7"
brew "unixodbc"
cask "1password"
cask "alfred"
cask "android-studio"
cask "bettertouchtool"
cask "biscuit"
cask "deepl"
cask "Figma"
cask "google-chrome"
cask "kindle"
cask "notion"
cask "slack"
cask "tower"
cask "visual-studio-code"
cask "zoom"
mas "LINE", id: 539883307
