tap "dart-lang/dart"
tap "leoafarias/fvm"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
brew "act"
brew "automake"
brew "cocoapods"
brew "direnv"
brew "fvm"
brew "git", link: false
brew "gpg"
brew "guile"
brew "gnutls"
brew "ideviceinstaller"
brew "libimobiledevice"
brew "libtool"
brew "mas"
brew "pinentry-mac"
brew "ruby-build"
brew "rbenv"
brew "ruby"
brew "ruby@2.7"
brew "unixodbc"
cask "1password"
cask "alfred"
cask "android-studio"
cask "cmd-eikana"
cask "deepl"
cask "Figma"
cask "google-chrome"
cask "kindle"
cask "notion"
cask "slack"
cask "tower"
cask "visual-studio-code"
cask "zoom"
mas "Bear", id: 1091189122
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "LINE", id: 539883307
mas "Magnet", id: 441258766
mas "MindNode", id: 1289197285
mas "Notion Web Clipper", id: 1559269364
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Spark", id: 1176895641
mas "Transporter", id: 1450874784
mas "Twitter", id: 1482454543
mas "Xcode", id: 497799835
