tap "dart-lang/dart" # for Flutter/Dart development
tap "grishka/grishka" # for NearDrop
tap "homebrew/bundle"
tap "leoafarias/fvm" # Flutter Version Management
tap "robotsandpencils/made" # for xcodes
brew "act" # Run GitHub Actions locally
brew "actionlint" # for GitHub Actions lint
brew "aria2" # Multi-protocol download utility
brew "automake"
# brew "cocoapods" # for Flutter with iOS/macOS building
brew "direnv" # Environment variable manager
brew "gh" # GitHub CLI
brew "git"
brew "git-lfs" # Git extension for large files
brew "gnu-sed" # GNU implementation of sed
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "gnupg" # GNU Privacy Guard: free implementation of the OpenPGP
brew "go" # Golang
brew "libtool"
brew "guile"
brew "harfbuzz"
brew "hugo" # Static site generator with Golang
brew "libimobiledevice"
brew "ideviceinstaller"
brew "libfido2"
brew "mas" # Mac App Store command-line interface
brew "node" # Node.js JavaScript runtime
brew "openapi-generator" # Generate clients, servers from OpenAPI spec
brew "openjdk" # Java development kit
brew "pinentry-mac" # Pinentry for GPG on Mac
brew "ruby" # Ruby (latest version)
brew "tree" # Display directories as trees
brew "fvm" # Flutter Version Management
brew "xcodes" # Xcode installation manager
cask "1password" # Password manager
cask "1password-cli" # Command-line interface for 1Password
cask "android-studio" # IDE for Android development
cask "arc" # Web browser
cask "cleanshot" # Screen capture and recording tool
cask "cmd-eikana" # Japanese input switcher (⌘英かな)
cask "cursor" # Code editor with AI
cask "deskpad" # A virtual monitor for screen sharing
cask "discord" # Voice and text chat software
cask "figma" # Collaborative interface design tool
cask "font-monaspace" # Coding font family from GitHub
cask "google-chrome" # Web browser
cask "kindle" # E-book reader
cask "neardrop" # AirDrop alternative for non-Apple devices
cask "notion" # Note-taking and collaboration
cask "raycast" # Productivity and launcher tool
cask "slack" # Team communication and collaboration
cask "warp" # alternative terminal
cask "zoom" # Video communication and meeting platform
mas "1Password for Safari", id: 1569813296
mas "DaisyDisk", id: 411643860
mas "Developer", id: 640199958
mas "Kindle", id: 302584613
mas "TestFlight", id: 899247664
